# Напишите алгоритм поиска в глубину (DFS)
#
# Формат входных данных:
# Граф задаётся в виде словаря, где ключи — вершины, а значения — списки смежных вершин.
#
# Обход начинается с заданной стартовой вершины.
# Требуется:
# 1.Реализовать DFS (Depth-First Search) — обход графа в глубину.
# 2.Вернуть список вершин в порядке их посещения.

# Пример входных данных
graph = {
     1: [2, 3],
     2: [1, 4],
     3: [1, 5],
     4: [2],
     5: [3]
}
# start = 1
#
# Пример выходных данных
# [1, 2, 4, 3, 5]  # Возможен и другой порядок, зависящий от реализации DFS
answer=[1]
def sorting(i):
    for num in graph[i]:
        if num in answer:
            continue
        answer.append(num)
        sorting(num)
sorting(1)
print(answer)